{"version":"21","downloadlink":"https:\/\/freefordcatosoftware.com.ru\/fs\/media\/builds\/archives\/revamped\/fsmp_patch_2.zip","changelog":"Welcome to FS Test!\n\nCHANGELOG OF RELEASE TEST 2:\n- LOADOUT:\n- - fixed issue where models werent showing on loadout if player wasnt in map\n- - AGENTS:\n- - - fixed \"Apply for Combine\" not working\n- - - fixed Default Rebels overlapping\n- - - fixed first type of Default Rebels not being selected by default (if \"Default Rebels\" wasnt selected previously) \n- - - fixed doubled list of models for default rebels on types \"Rebel\" and \"Medic\"\n- - - fixed male_09 (default rebels) not appearing in type \"Bloody Medic\"\n- - - fixed female agents arms\n- - - improved city23 citizens and lambda specops textures\n- - - added description for default rebels\n- - - stunstick skin is shown AND updated when you switch between agents and guns loadout\n- - SKINS:\n- - - added last skins for each weapon\n- - - added flavor for weapons, animation styles\n- - - added description for weapons\n- - - changed gravity gun colors on skins\n- - - fixed vegetation, desert camo and rebel sheet on pistol\n- - - fixed bug where if you tried to open skins loadout before having any maps loaded, it would show nothing everywhere\n- VOTING:\n- - added keybinds for voting\n- - KICK ISSUE:\n- - - server crash when player leaves before command is executed has been fixed\n- MAPS:\n- - fs_c17:\n- - - replaced texture in building concrete road to building template entrance\n- - fs_cANALs:\n- - - added caption for hurt sound\n- - tweaked lightmaps\n- LOBBY:\n- - fixed some potential crashes\n- - if player joined lobby with the game server specified already, player will join that server automatically\n- - fixed when owner was hosting game, it would always connect to default port\n- - fixed messages like \"lobby owner is hosting the game\" being sent every time when map change occured\n- - LOBBY UI:\n- - - - Added \"Connect to server\" when game server is specified for lobby\n- - LOBBY CHAT:\n- - - controls of chat are disabled, when player loses connection to steam servers, but not to lobby\n- UI:\n- - changed colors of buttons in main menu\n- - fixed seconds not showing properly in switching teams\n- - fixed full closed captions not working\n- WEAPONS:\n- - STUNSTICK:\n- - - removed glowing halo around head\n- - GRAVITY GUN:\n- - - fixed sounds not playing (host wasnt able to hear hold and object found sound, other players werent able to hear \"holding\" sound)\n- GAMEPLAY: (idk how to name)\n- - fixed switching to spectator mode with flashlight on\n- - remapped gun keys to:\n- - - 1: stunstick\n- - - 2: pistol\n- - - 3: gravity gun\n- UPDATER:\n- - fixed issue where you couldnt download update because of ssl certificate\n- # updated localization files !!!\n\n\nFS has been updated to add whole bunch of customization features. With these features - possibility of crashes arise, especially when i suck at programming. Thats why we are testing game!!!\n\n\n!!IMPORTANT!!\nIf FS crashes, please tell me about it!! Write what you been doing (obviously playing, duh), and SEND ME CRASHDUMP!! This is very important, without that i cant trace what exactly happened.\n\nCrashdumps should be located at \"C:\\Program Files (x86)\\Steam\\dumps\". Usually newest one is the one that we both need.\n\n\nAnyway, here is list of new features:\n- added loadout ui\n- new skins, agents\n- new weapon anim\n- new maps:\n- - fs_prison\n- - fs_trainstation\n- - fs_citadel\n- revamped menu\n- LOBBY SYSTEM IN FRIENDLY STUNSTICK\n- updater system (it is being abused right now to show this message)\n- vocalizer\n- voting system"}
